rtreichl/msp430radio/Menu.c

#include <driver/encoder.h>
#include <driver/lcd.h>
#include <driver/si4735.h>
#include <driver/i2c.h>
#include <Timer.h>
#include <stdio.h>
#include "Radio.h"
#include <driver/flash.h>
#include "Menu.h"
#include "string.h"
#include <driver/tpa2016d2.h>
//#include "AudioSwitch.h"
#include "MSP430G2553_Clock_Timer.h"



///////////////////////////////////////////////////////////////////////////DEFINES+EXTERNE VARIABLEN+FUNKTIONEN/////////////////////////////////////////////////////////////////////////////

extern volatile unsigned char encoder_1_button, encoder_2_button, sekunde, sec , posrt;

////////////////////////////////////////////////////////////////////////////////ENDE DEFINES////////////////////////////////////////////////////////////////////////////////////////////////

void menu(void)
{

	/********************************************************************DEKLARATION VARIABLEN*********************************************************************************************/
	
	static char counter2_first_lvl = MAX_FIRST_LVL,
				counter2_second_lvl = MAX_SECOND_LVL,
				counter2_third_lvl = MAX_THIRD_LVL,
				counter2_zero_lvl = MAX_ZERO_LVL;
	char string[17];
	static signed char en_counter1 = 0,act_vol = 20, vol_mute = 0,en_counter2 = 0;
	static unsigned char act_freq = 203;
	static int Radio_States = 0;
	static char Station_Name[9], Radion_Text[65], Akt_Radio_Text[65] = "Radio Text";
	static char delay_vol = 0,delay_freq = 0;
	static char s_time[7] = "\6  :  ", s_date[9] = "01.01.14";
	static char init = 0, set = 0, radio_on = 1;
	static uint8_t display_mode = 2;
	static uint8_t counter_sum = 0;
	uint8_t flush = 0;
	char rsq[4];

	//char sel_mode,AM_MODE,FM_MODE,rds_mode,RDS_OFF,RDS_ON,pty_mode,tpta_mode,PTY_OFF,PTY_ON,TPTA_OFF,TPTA_ON,RESET,NO,YES,standby_mode;
	unsigned int i=0;
	/*********************************************************************ENDE VARIABLEN***************************************************************************************************/

	////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	///////////////////////////////////////////////////////////////////BEGINN MENÜSTEUERUNG/////////////////////////////////////////////////////////////////////////////////////////////////
	////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


	/***************************************************************encoder-auswahl für encoder 1******************************************************************************************/
	/****************************************Encoderzustände: l (lang gedrückt), k (kurz gedrückt), f (Taste wieder frei)******************************************************************/
	/**************************************************************************************************************************************************************************************/

	flush = 0;
	if(init == 0)																									//Beim einschalten Initialisieren
	{
		time_date(0, 0, 1, 1, 14, 1, 0, s_time, s_date);
		Amplifier_Gain(AMPLIFIER_GAIN);
		init = 1;
	}
	en_counter1 +=  Encoder_1_get_count();																			//Encoderwert für Encoder 1 um geänderten Encoderwert erhöhen
	en_counter2 +=  Encoder_2_get_count();																			//Encoderwert für Encoder 2 um geänderten Encoderwert erhöhen

	if(counter_sum != en_counter1 + en_counter2 + posrt){															//Überprüfe ob sich Summe aus den Encoder-Werten und der aktuellen Radio-Text Position geändert hat
		flush |= 1;
		counter_sum = en_counter1 + en_counter2 + posrt;
	}



	if (encoder_1_button == BUTTON_PRESS_SHORT)																						//Bei kurzem Tastendruck Volume Mute ON/OFF
	{
		vol_mute ^= 1;
		Amplifier_Shutdown(vol_mute);
		flush |= 1;
		encoder_1_button = BUTTON_FREE;
	}
	else if (encoder_1_button == BUTTON_PRESS_LONG)																					//Bei langem Tastendruck in Standby-Modus wechseln
	{
		if(set==0)
		{
			enter_standby();
			set = 1;
		}
		if(set == 1)
		{
			exit_standby();
			set = 0;
		}
		flush |= 1;
		encoder_1_button = BUTTON_FREE;
	}
	/**********************************************************************ende encoder 1**************************************************************************************************/

	/**************************************************************encoder-auswahl für encoder 2*******************************************************************************************/
	/*********************************************Encoderzustände: l (lang gedrückt), k (kurz gedrückt), f (Taste wieder frei)*************************************************************/
	/**************************************************************************************************************************************************************************************/

	if(encoder_2_button != BUTTON_FREE) {
		flush |= 1;
	}

	switch (counter2_zero_lvl)
	{
	case 1:																											//Senderauswahl
		switch (counter2_first_lvl)
		{
		case 0:																										//Senderliste
			en_counter2 = check_for_out_of_range(en_counter2, 15);
			en_counter2 = en_counter2 % 15;																			//Auf 15 Werte begrenzen(gibt nicht mehr)
			if(encoder_2_button == BUTTON_PRESS_SHORT)
			{
				char tmp = 0;
				tmp = *(char *)(FLASH_ADR_STATION_FREQ + en_counter2*10);
				if(tmp != 0xFF)																						//Falls ein Sender ausgewählt	
				{
					//USCI_I2C_INIT(0x11,80);
					act_freq = tmp;																					//Übernehme Frequenz
					SI4735_Fm_Tune_Freq_2((875 + (char)(act_freq-1))*10);
					Radio_States |= (1<<15);
					strncpy(Akt_Radio_Text, "Radio Text", 64);
				}
				en_counter2 = 0;																					//Durchlaufender Counter wird wieder Null gesetzt, da eine Ebene höher
				counter2_zero_lvl = MAX_ZERO_LVL;																	//Wieder auf den Haupt-
				counter2_first_lvl = MAX_FIRST_LVL;																	//bildschirm kommen
				encoder_2_button = BUTTON_FREE;
			}
			break;
		case 3:																										//Speichern
			en_counter2 = check_for_out_of_range(en_counter2, 15);
			en_counter2 = en_counter2 % 15;																			//Auf 15 Werte begrenzen(Anzahl der Speicherplätze)
			if (encoder_2_button == BUTTON_PRESS_SHORT)
			{
				stor_data_to_flash ((char *)FLASH_ADR_STATION_NAME, Station_Name, act_freq, en_counter2*10); 

