rtreichl/msp430radio/Menu.c
				counter2_zero_lvl = MAX_ZERO_LVL;																	//Wieder auf den Haupt-
				counter2_first_lvl = MAX_FIRST_LVL;																	//bildschirm kommen
				en_counter2 = 0;																					//Durchlaufender Counter wird wieder Null gesetzt, da eine Ebene höher
				encoder_2_button = BUTTON_FREE;
			}
			break;
		case 1:
			act_freq = (radio_seeking(1)/10 - 875 +1);
			//(875 + (char)(act_freq-1))*10
			Radio_States |= (1<<15);
			strncpy(Akt_Radio_Text, "Radio Text", 64);
			counter2_zero_lvl = MAX_ZERO_LVL;																	//Wieder auf den Haupt-
			counter2_first_lvl = MAX_FIRST_LVL;																	//bildschirm kommen
			break;
		case 2:
			act_freq = (radio_seeking(0)/10 - 875 +1);
			Radio_States |= (1<<15);
			strncpy(Akt_Radio_Text, "Radio Text", 64);
			counter2_zero_lvl = MAX_ZERO_LVL;																	//Wieder auf den Haupt-
			counter2_first_lvl = MAX_FIRST_LVL;
			break;
		default:
			en_counter2 = check_for_out_of_range(en_counter2, 6);
			en_counter2 = en_counter2 % 6;																			//Auf 3 Werte begrenzen(Senderliste,Speichern,Return)
			if (encoder_2_button == BUTTON_PRESS_SHORT)
			{
				counter2_first_lvl = en_counter2;																	//Encoderwert für erste ebene ermitteln
				encoder_2_button = BUTTON_FREE;
				en_counter2 = 0;																					//Durchlaufender Counter wird wieder Null gesetzt, da eine Ebene tiefer
			}
		}
		break;
	case 2:																											//Einstellungen
		switch (counter2_first_lvl)
		{
		case 0:																										//AM/FM
				en_counter2 = check_for_out_of_range(en_counter2, 2);
				en_counter2 = en_counter2 % 2;																		//Auf 2 begrenzt(AM/FM)
				if (encoder_2_button == BUTTON_PRESS_SHORT)
				{
					counter2_second_lvl = en_counter2;																//Bei kurzem Tastendruck Encoder-Wert für dritte Ebene übernehmen
					encoder_2_button = BUTTON_FREE;
				}

			break;
		case 1:																										//Anzeige
			switch(counter2_second_lvl)
			{
			case 0:																									//rds(ON/OFF)
					en_counter2 = check_for_out_of_range(en_counter2, 3);
					en_counter2 = en_counter2 % 3;																	//Auf 2 begrenzt
					if (encoder_2_button == BUTTON_PRESS_SHORT)
					{
						counter2_third_lvl = en_counter2;															//Bei kurzem Tastendruck Encoder-Wert für dritte Ebene übernehmen
						encoder_2_button = BUTTON_FREE;

					}

				break;
			case 1:																									//tp/ta
					en_counter2 = check_for_out_of_range(en_counter2, 2);
					en_counter2 = en_counter2 % 2;																	//Auf 2 begrenzt(ON/OFF)
					if (encoder_2_button == BUTTON_PRESS_SHORT)
					{
						counter2_third_lvl = en_counter2;															//Bei kurzem Tastendruck Encoder-Wert für dritte Ebene übernehmen
						encoder_2_button = BUTTON_FREE;
					}

				break;
			case 2:																									//return
					counter2_first_lvl = MAX_FIRST_LVL;																//Wieder in das Menü 
					counter2_second_lvl = MAX_SECOND_LVL;															//der Einstellungen springen
					encoder_2_button = BUTTON_FREE;
					en_counter2 = 0;																				
				break;
			default:																								//anzeige-auswahl
					en_counter2 = check_for_out_of_range(en_counter2, 4);
					en_counter2 = en_counter2 % 3;																	//Auf 4 begrenzen(RDS/PTY/TPTA/RETURN)
					if (encoder_2_button == BUTTON_PRESS_SHORT)
					{
						counter2_second_lvl = en_counter2;															//Bei kurzem Tastendruck Encoder-Wert für zweite Ebene übernehmen
						encoder_2_button = BUTTON_FREE;
						en_counter2 = 0;
					}
			}
			break;
		case 2:																										//werkszustand
				en_counter2 = check_for_out_of_range(en_counter2, 2);
				en_counter2 = en_counter2 % 2;																		//Auf 2 begrenzen(ON/OFF)
				if (encoder_2_button == BUTTON_PRESS_SHORT)
				{
					counter2_second_lvl = en_counter2;																//Bei kurzem Tastendruck Encoder-Wert für zweite Ebene übernehmen
					encoder_2_button = BUTTON_FREE;

				}
			break;
		case 3:																										//Equalizer
			en_counter2 = check_for_out_of_range(en_counter2, 6);
			en_counter2 = en_counter2 % 6;																			//Auf 6 begrenzen(POP,ROCK,JAZZ;
			if (encoder_2_button == BUTTON_PRESS_SHORT)
			{
				counter2_second_lvl = en_counter2;																	//Bei kurzem Tastendruck Encoder-Wert für zweite Ebene übernehmen
				encoder_2_button = BUTTON_FREE;
			}
			break;
		case 4:																										//Audio-Switch
			en_counter2 = check_for_out_of_range(en_counter2, 2);
			en_counter2 = en_counter2 % 2;
			if (encoder_2_button == BUTTON_PRESS_SHORT)
			{
				counter2_second_lvl = en_counter2;																	//Bei kurzem Tastendruck Encoder-Wert für zweite Ebene übernehmen
				encoder_2_button = BUTTON_FREE;
			}
			break;
		case 5:																										//return
				encoder_2_button = BUTTON_FREE;
				counter2_zero_lvl = MAX_ZERO_LVL;																	//Wieder auf Haupt-
				counter2_first_lvl = MAX_FIRST_LVL;																	//anzeige wechseln
				en_counter2 = 0;
			break;
		
		default:
				en_counter2 = check_for_out_of_range(en_counter2, 6);
				en_counter2 = en_counter2 % 6;																		//Auf 6 begrenzen(AM/FM,Anzeige,Equalizer,Audio-Switch,Werkszustand,Return)
				if (encoder_2_button == BUTTON_PRESS_SHORT)
				{
					counter2_first_lvl = en_counter2;																//Bei kurzem Tastendruck Encoder-Wert für erste Ebene übernehmen
					encoder_2_button = BUTTON_FREE;
					en_counter2 = 0;
				}
		}
		break;
		default:
		if (encoder_2_button == BUTTON_PRESS_SHORT)
		{
			counter2_zero_lvl = 1;																					//Bei kurzem Tastendruck Auswahl der Senderliste
			encoder_2_button = BUTTON_FREE;
			en_counter2 = 0;
		}
		else if (encoder_2_button == BUTTON_PRESS_LONG)
		{
			counter2_zero_lvl = 2;																					//Bei langem Tastendruck Auswahl Einstellungen
			encoder_2_button = BUTTON_FREE;
			en_counter2 = 0;
		}
	}
	/***************************************************************************ende encoder 2********************************************************************************************/
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	////////////////////////////////////////////////////////////////////////ENDE MENÜ STEUERUNG////////////////////////////////////////////////////////////////////////////////////////////
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	////////////////////////////////////////////////////////////////////////BEGINN MENÜ-AUSWAHL////////////////////////////////////////////////////////////////////////////////////////////
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

	/*****************************************************************************ENCODER 1***********************************************************************************************/

	if(counter2_zero_lvl == MAX_ZERO_LVL)
	{
		if (en_counter1 != 0)																						//Wenn sich der Encoder-wert ändert Lautstärke ändern
			{
				act_vol += en_counter1;
				if(act_vol > 60)																					//MAX-VOL erreicht
				{					
					act_vol = 60;

