rtreichl/msp430radio/Menu.c
				}
				else if(act_vol < 0 )																				//MIN-VOL erreicht
				{					
					act_vol = 0;

				}
				//Amplifier_Gain(act_vol - 30);
				SI4735_Set_Volume(act_vol);
				en_counter1 = 0;
				delay_vol = 1;
				sekunde = 0;
			}
	}
	
	/********************************************************************************ENDE ENCODER 1***************************************************************************************/

	/**********************************************************************************ENCODER 2******************************************************************************************/
	switch (counter2_zero_lvl)
	{
	case 2:																											//Einstellungen

			switch (counter2_first_lvl)																				//Auswahl AM/FM,Anzeige oder Werkszustand
			{
			case 0:																									//AM/FM

					switch(counter2_second_lvl)
					{
					case 0:																							

							//sel_mode = AM_MODE;
							counter2_first_lvl = MAX_FIRST_LVL;														//Rücksprung zu 
							counter2_second_lvl = MAX_SECOND_LVL;													//Einstellungen
							en_counter2 = 0;																		//Pfeil soll auf AM/FM zeigen
						break;
					case 1:																							

							//sel_mode = FM_MODE;
							counter2_first_lvl = MAX_FIRST_LVL;														//Rücksprung zu
							counter2_second_lvl = MAX_SECOND_LVL;													//Einstellungen
							en_counter2 = 0;																		//Pfeil soll auf AM/FM zeigen
						break;
					default:																						//Anzeige für AM/FM Untermenü anzeigen
						lcd_create_view("AM", 1, 0, 0);
						lcd_create_view("FM", 1, 1, 0);
						lcd_create_view("~", 0, en_counter2, 0);
					}
					break;
			case 1:																									//Anzeigenauswahl

				switch (counter2_second_lvl)
				{
				case 0:																								//RDS

						if (counter2_third_lvl < MAX_THIRD_LVL)	{
								display_mode = counter2_third_lvl;
								//rds_mode = RDS_OFF;
								counter2_second_lvl = MAX_SECOND_LVL;												//Rücksprung zu
								counter2_third_lvl = MAX_THIRD_LVL;													//Anzeigen-Untermenü
								en_counter2 = 0;													//Pfeil soll auf RDS zeigen
						}
						else {																						//RDS-Untermenü anzeigen
							lcd_create_view("RDS", 1, 0, 0);
							lcd_create_view("PTY", 1, 1, 0);
							lcd_create_view("Signal Report", 1, 2, 0);
							lcd_create_view("~", 0, en_counter2, 0);
						}
					break;
				case 1:																								//TP/TA

						switch (counter2_third_lvl)
						{
						case 0:

								//tpta_mode = TPTA_ON;
								counter2_second_lvl = MAX_SECOND_LVL;												//Rücksprung zu
								counter2_third_lvl = MAX_THIRD_LVL;													//Anzeigen-Untermenü
								en_counter2 = 2;																	//Pfeil soll auf TPTA zeigen
								
							break;
						case 1:

								//tpta_mode = TPTA_OFF;
								counter2_second_lvl = MAX_SECOND_LVL;												//Rücksprung zu
								counter2_third_lvl = MAX_THIRD_LVL;													//Anzeigen-Untermenü
								en_counter2 = 2;																	//Pfeil soll auf TPTA zeigen
								
							break;
						default:																					//TPTA-Untermenü anzeigen
							lcd_create_view("TP/TA ON", 1, 0, 0);
							lcd_create_view("TP/TA OFF", 1, 1, 0);
							lcd_create_view("~", 0, en_counter2, 0);
						}
					break;
				default:																							//Anzeige-Untermenü anzeigen
																								// wenn einer der ersten drei elemente ausgewählt ist
						
							lcd_create_view("RDS/PTY", 1, 0, 0);
							lcd_create_view("TP/TA", 1, 1, 0);
							lcd_create_view("Return", 1, 2, 0);
							lcd_create_view("~", 0, en_counter2, 0);
						
				}
				break;
			case 2:																									//Werkszustand

					switch (counter2_second_lvl)
					{
					case 0:
							counter2_first_lvl = MAX_FIRST_LVL;														//Rücksprung zu
							counter2_second_lvl = MAX_SECOND_LVL;													//Einstellungen
							en_counter2 = 2;																		//Pfeil soll auf Werkszustand zeigen						
						break;
					case 1:
							for(i = 0; i < 15; i++)
							{
								stor_data_to_flash ((char *)FLASH_ADR_STATION_NAME, "<Empty>", 0xFF, i*10);			//Speicher löschen
							}
							counter2_first_lvl = MAX_FIRST_LVL;														//Rücksprung zu
							counter2_second_lvl = MAX_SECOND_LVL;													//Einstellungen
							en_counter2 = 2;																		//Pfeil soll auf Werkszustand zeigen
							
						break;
					default:																						//Werkszustand-Untermenü anzeigen
						lcd_create_view("NEIN", 1, 0, 0);
						lcd_create_view("JA", 1, 1, 0);
						lcd_create_view("~", 0, en_counter2, 0);
					}
				break;
			case 3:																									//Equalizer
				if (counter2_second_lvl < MAX_SECOND_LVL) {
					Amplifier_set_equalizer_mode(counter2_second_lvl, AMPLIFIER_GAIN);																//pop
					counter2_first_lvl = MAX_FIRST_LVL;																//Rücksprung zu
					counter2_second_lvl = MAX_SECOND_LVL;															//Einstellungen
					en_counter2 = 3;																				//Pfeil soll auf Equalizer zeigen
				}
				else {																								//Equalizer-Untermenü anzeigen
					if (en_counter2 < 3)																			// wenn einer der ersten drei elemente ausgewählt ist
					{
						lcd_create_view("Pop", 1, 0, 0);
						lcd_create_view("Klassik", 1, 1, 0);
						lcd_create_view("Jazz", 1, 2, 0);
						lcd_create_view("~", 0, en_counter2, 0);
					}
					else
					{
						lcd_create_view("Hip-Hop", 1, 0, 0);
						lcd_create_view("Rock", 1, 1, 0);
						lcd_create_view("News/Voice", 1, 2, 0);
						lcd_create_view("~", 0, en_counter2 - 3, 0);
					}
				}
				break;
			case 4:																									//Audio-Switch
				switch (counter2_second_lvl)
				{
				case 0:																								//AUX-auswahl
					//AudioSwitch(AUX_LEFT,AUX_RIGHT);
					counter2_second_lvl = MAX_SECOND_LVL;															//Rücksprung zu
					counter2_first_lvl = MAX_FIRST_LVL;																//Einstellungen
					en_counter2 = 4;
					radio_on = 0;
					break;
				case 1:
					//AudioSwitch(RADIO_LEFT,RADIO_RIGHT);															//Audio-Switch auf lautsprecher
					counter2_second_lvl = MAX_SECOND_LVL;															//Rücksprung zu
					counter2_first_lvl = MAX_FIRST_LVL;																//Einstellungen
					en_counter2 = 4;
					radio_on = 1;
					break;
				default:
					lcd_create_view("AUX", 1, 0, 0);
					lcd_create_view("Radio", 1, 1, 0);
					lcd_create_view("~", 0, en_counter2, 0);
				}
				break;
			default:																								//Einstellungen-Untermenü anzeigen
				if (en_counter2 < 3)																				// wenn einer der ersten drei elemente ausgewählt ist
				{
					lcd_create_view("AM/FM", 1, 0, 0);
					lcd_create_view("Anzeige", 1, 1, 0);
					lcd_create_view("Werkszustand", 1, 2, 0);
					lcd_create_view("~", 0, en_counter2, 0);
				}
				else
				{
					lcd_create_view("Equalizer", 1, 0, 0);
					lcd_create_view("Audio-Switch", 1, 1, 0);
					lcd_create_view("Return", 1, 2, 0);
					lcd_create_view("~", 0, en_counter2 - 3, 0);
				}

