rtreichl/msp430radio/Menu.c
			}
		break;											

		case 1:																										//Senderliste

			switch (counter2_first_lvl)
			{
			case 1:																									//Speichern
				lcd_create_view("S:", 14, 0, 0);
			case 0:																									//listeneintrag auswählen und Einträge anzeigen
				if(counter2_first_lvl == 0)
				lcd_create_view("A:", 14, 0, 0);
				for (i = (en_counter2 / 3) * 3 ; i < (en_counter2 / 3) * 3 + 3; i++)
				{
					null_befor_value(string, i+1, 0);
					string[2] = '.';
					string[3] = 0;
					lcd_create_view(string, 1, i % 3, 0);
					lcd_create_view((char *)(FLASH_ADR_STATION_NAME + i * 10), 4, i % 3, 0);
				}
				lcd_create_view("~", 0, en_counter2 % 3, 0);
				break;
			case 2:																									//Return
				counter2_zero_lvl = MAX_ZERO_LVL;																	//Rücksprung zu
				counter2_first_lvl = MAX_FIRST_LVL;																	//Hauptbildschirm
				en_counter2 = 0;
				break;
			default:
				//Seeking function
				//Auto search function
				if (en_counter2 < 3)																				// wenn einer der ersten drei elemente ausgewählt ist
				{
					lcd_create_view("Senderliste", 1, 0, 0);
					lcd_create_view("Suche Aufwärts", 1, 1, 0);
					lcd_create_view("Suche Abwärts", 1, 2, 0);
					lcd_create_view("~", 0, en_counter2, 0);
				}
				else {
					lcd_create_view("Sendersuchlauf", 1, 0, 0);
					lcd_create_view("Sender Speichern", 1, 1, 0);
					lcd_create_view("Return", 1, 2, 0);
					lcd_create_view("~", 0, en_counter2-3, 0);
				}
			}
			break;
		default:																									//auf Frequenzänderung reagieren
			if (en_counter2 != 0)																					//wenn Encoder gedreht wird												
			{
				Radio_States |= (1<<15);
				strncpy(Akt_Radio_Text,"Radio Text", 64);
				act_freq += en_counter2;
				if(act_freq > 205)																					//Freq bei 107.8MHz
				{
					act_freq = 1;
				}
				else if(act_freq < 1 )																				//Freq bei 87.5MHz
				{
					act_freq = 205;
				}
				SI4735_Fm_Tune_Freq_2((875 + (char)(act_freq - 1)) * 10);
				en_counter2 = 0;
				delay_freq = 1;
				sekunde = 0;
			}
			if(radio_on) {
				get_rds_data(&Radio_States, Station_Name, Radion_Text);												//RDS-Daten auslesen
				if(Radio_States & (1<<14)) {
					lcd_create_view(Station_Name, 0, 0, 0);
				}
				else {																								//ansonsten Frequenz anzeigen
					sprintf(string, "%d.%dMHz", (act_freq + 874) / 10, (act_freq + 874) % 10);
					lcd_create_view(string, 0, 0, 0);
				}
			}
			else {
				lcd_create_view("LINE-IN ", 0, 0, 0);
			}
			if(Radio_States & 0x1000) {																				//aktuelles Datum über RDS erhalten
 				Radio_States &= ~0x1000;
				sec = 0;
			}
			time_date(0, 0, 0, 0, 0, 0, 0, s_time, s_date);															//Lese Datum und Zeit String aus
			lcd_create_view(s_time, 10, 0, 0);																	//Zeige Zeit an
			lcd_create_view(s_date, 8, 1, 0);																	//Zeige Datum an
			if(vol_mute) {																							//vol_mute zeichen ausgeben
				lcd_create_view("\7÷", 0, 1, 0);
			}
			else																									//vol_mute off zeichen ausgeben
			{
				lcd_create_view("\7û", 0, 1, 0);
			}
			if(delay_freq == 1 && sekunde < BLEND_OUT_AFTER)														//Delay für Bargraph Frequenz
			{
				lcd_bargraph((act_freq * 60) / 204);
			}
			else
			{
				delay_freq = 0;
			}
			if(delay_vol == 1 && sekunde < BLEND_OUT_AFTER)															//Delay für Bargraph Volume
			{
				sprintf(string, "=%d%c", (act_vol * 100) / 60, 0x25);
				lcd_create_view(string, 1, 1, 0);
				lcd_bargraph(act_vol);
			}
			else {
				delay_vol = 0;
			}
			if (display_mode != 2) {
			if(delay_vol == 0 && delay_freq == 0)																	//Radiotext anzeigen wenn bargraph kein Encoder gedreht wird
			{
				if(posrt < 16)																						//So lange der Text nicht am linken Rand angekommen ist kopiere nur die anzahl der angezeigen Zeichen
				{
					strncpy(string, Akt_Radio_Text, posrt + 1);														//Kopiere die Anzahl der Zeichen erscheinen sollen
					lcd_create_view(string, 15 - posrt , 2, 0);														//Text in den Display Speicher ablegen
				}
				else																								//Wenn der Text den bereich unten ausfüllt
				{
					strncpy(string, Akt_Radio_Text + posrt - 15, 16);													//Kopiere die zeichen die aktuell durch geschiftet werden sollen
					lcd_create_view(string, 0, 2, 0);																//Text in den Display Speicher ablegen
				}
				string[16] = 0;																						//String Abschluss einfügen
				if(string[0] == 0)																					//Wenn nix übergeben wird dann
				{
					string[0] = 0x20;																				//Leerzeichen einfügen
					string[1] = 0;																					//String Abschlss einfügen
					lcd_create_view(string, 0, 2, 0);																//Text in den Display Speicher ablegen
				}
			}
			}
			else {
				uint8_t temp[8];
				get_signal_qual(temp);
				//sprintf(rsq, "%d", temp[3] & 0x7F);
				//lcd_create_view(rsq, 8, 1, 0);
				sprintf(rsq, "  %ddBuV", temp[4]);
				lcd_create_view(rsq, 8 + (8 - strlen(rsq)), 1, 0);
				sprintf(rsq, "%ddB", temp[5]);
				lcd_create_view(rsq, (4 - strlen(rsq)), 2, 0);
				sprintf(rsq, "%d%c", temp[6], 0x25);
				lcd_create_view(rsq, 5 + (4 - strlen(rsq)), 2, 0);
				sprintf(rsq, "%dkHz", (int8_t)temp[7]);
				lcd_create_view(rsq, 11 + (5 - strlen(rsq)), 2, 0);
			}
			if(Radio_States & 0x2000 && posrt == 78)																//Radiotext(wenn neu vorhanden) kopieren
			{
				Radio_States &= ~0x2000;
				strncpy(Akt_Radio_Text, Radion_Text, 64);
			}


	}

	lcd_create_view("", 0, 0, flush);
	/*******************************************************************************ENDE ENCODER 2**************************************************************************************/

	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	//////////////////////////////////////////////////////////////////////////////ENDE MENÜ-AUSWAHL//////////////////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
}


